BAS BMEKZU Project/src/Enums/ВидыЕСВ/ВидыЕСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЕСВ</name>
  <enumValues>
    <name>ОсновнаяЗарплата</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамГПХ</name>
  </enumValues>
  <enumValues>
    <name>Больничные</name>
  </enumValues>
  <enumValues>
    <name>Декретные</name>
  </enumValues>
  <enumValues>
    <name>НачисленияМобилизованным</name>
  </enumValues>
  <enumValues>
    <name>НеУчитывается</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоДоговоруГПХ</name>
  </enumValues>
  <enumValues>
    <name>Доплата</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>Индексация</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоМЗП</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенкомДо3Лет</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенкомДо6Лет</name>
  </enumValues>
  <enumValues>
    <name>НачисленияМобилизованным</name>
  </enumValues>
  <enumValues>
    <name>ПрогулИлиНеявка</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/CommonModules/УчетСтраховыхВзносовПовтИсп/Module.bsl
Функция ОпределитьНалоговыйПериод(ПериодРегистрации, ПериодДействия, ВидЕСВ, КатегорияНачисления) Экспорт
	
	Если НЕ ЗНачениеЗаполнено(ВидЕСВ) ИЛИ ВидЕСВ = Перечисления.ВидыЕСВ.НеУчитывается Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Если ВидЕСВ = Перечисления.ВидыЕСВ.ОсновнаяЗарплата Тогда
		//Отпуска учитываются по периоду действия, если он за текущий или будущий период
		Если КатегорияНачисления = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска Тогда
			Возврат МАКС(ПериодРегистрации, ПериодДействия);
		КонецЕсли;
		//Все прочие учитываются по периоду регистрации
		Возврат ПериодРегистрации;
	КонецЕсли;
	
	Если ВидЕСВ = Перечисления.ВидыЕСВ.ПоДоговорамГПХ Тогда
		//Договора учитываются по периоду действия, если он за текущий или прошедший период
		Возврат МИН(ПериодРегистрации, ПериодДействия);
	КонецЕсли;
	
	Если ВидЕСВ = Перечисления.ВидыЕСВ.Больничные Тогда
		//Больничные учитываются по периоду действия, если он за текущий или прошедший период
		Возврат МИН(ПериодРегистрации, ПериодДействия);
	КонецЕсли;
	
	Если ВидЕСВ = Перечисления.ВидыЕСВ.Декретные Тогда
		//Декретные учитываются по периоду действия
		Возврат ПериодДействия;
	КонецЕсли;
	
	//Все прочие учитываются по периоду регистрации
	Возврат ПериодРегистрации;
	
КонецФункции
